---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ProjectPosition Properties
ProjectPosition Class See Also Send Feedback
---

The ProjectPosition type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Angle | Angle from True North. |
|  | EastWest | East/West offset. |
|  | Elevation | Elevation above ground level. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NorthSouth | North/South offset |

# See Also

ProjectPosition Class

Autodesk.Revit.DB Namespace